JCL code to add sequence number in a file
//STEP01     EXEC PGM=SORT
//SYSPRINT   DD SYSOUT=*
//SYSOUT     DD SYSOUT=*
//SORTIN     DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SORTOUT    DD DSN=DCIAKK2.AKASH.ADD.SEQ,DISP=SHR
//SYSIN      DD *
  OPTION COPY
  OUTREC BUILD=(1:1,70,75:SEQNUM,3,ZD,START=100,INCR=1)
/*
