STEP01 - COPY FIRST 10 RECORDS FROM A FILE TO ANOTHER FILE
STEP02 - COPY ALL RECORDS FROM A FILE BY SKIPPING FIRST 10 RECORDS TO ANOTHER FILE 
//PJ96106A    JOB (10),'AKASH',NOTIFY=&SYSUID
//STEP01      EXEC PGM=SORT
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//SORTIN      DD DSN=PJ96106.TEST.PSFILE,DISP=SHR
//SORTOUT     DD DSN=PJ96106.TEST.PSFILE6,DISP=SHR
//SYSIN       DD *
  SORT FIELDS=COPY,STOPAFT=10
//STEP02      EXEC PGM=SORT
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//SORTIN      DD DSN=PJ96106.TEST.PSFILE,DISP=SHR
//SORTOUT     DD DSN=PJ96106.TEST.PSFILE7,DISP=SHR
//SYSIN       DD *
  SORT FIELDS=COPY,SKIPREC=10
/*
