STEP01 - COPY RECORDS OF TWO OR THREE FILES INTO ONE FILES
STEP02 - COPY RECORDS FROM A FILE TO ANOTHER NEW FILE FROM WHICH COMPARISON HAS TO BE DONE
STEP03 - COMPARE THE OUTPUT FILES FROM STEP01 AND STEP02 AND PRINT THE RESULT IN A NEW FILE
//STEP01     EXEC PGM=SORT
//SYSOUT     DD SYSOUT=*
//SYSUDUMP   DD SYSOUT=*
//SORTMSG    DD SYSOUT=*
//SORTIN     DD DSN=PJ96106.TEST.PSFILE2,DISP=SHR
//           DD DSN=PJ96106.TEST.PSFILE3,DISP=SHR
//           DD DSN=PJ96106.TEST.PSFILE4,DISP=SHR
//SORTOUT    DD DSN=PJ96106.TEST.PSFILE5,DISP=SHR
//SYSIN      DD *
  SORT FIELDS=(1,6,CH,A)
/*
//STEP02     EXEC PGM=SORT
//SYSOUT     DD SYSOUT=*
//SYSUDUMP   DD SYSOUT=*
//SORTMSG    DD SYSOUT=*
//SORTIN     DD DSN=PJ96106.TEST.PSFILE,DISP=SHR
//SORTOUT    DD DSN=PJ96106.TEST.PSFILE6,DISP=SHR
//SYSIN      DD *
  SORT FIELDS=(1,6,CH,A)
/*
//STEP03     EXEC PGM=ISRSUPC,PARM=(OVSUML,LINECMP,' ',' ')
//F1DD       DD DSN=PJ96106.TEST.PSFILE5,DISP=SHR
//F2DD       DD DSN=PJ96106.TEST.PSFILE6,DISP=SHR
//OUTDD      DD DSN=PJ96106.TEST.PSFILE7,DISP=SHR
/*
