JCL code to copy records from VSAM to PS file
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD SYSOUT=*
//FILE1      DD DSN=DCIAKK2.AKASH.VSAM.FILE,DISP=SHR
//FILE2      DD DSN=DCIAKK2.AKASH.PS.FILE,DISP=SHR
//SYSIN      DD *
  REPRO INFILE(FILE1) OUTFILE(FILE2)
/*
