JCL code to copy all members of a PDS to a PS file
//STEP01     EXEC PGM=IEBPTPCH
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SYSUT1     DD DSN=DCIAKK2.AKASH.PDS,DISP=SHR
//SYSUT2     DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SYSIN      DD *
  PUNCH TYPORG=PO
/*
