JCL code to copy records from one VSAM to other VSAM file
//STEP01     EXEC PGM=IDCAMS
//SYSPRINT   DD SYSOUT=*
//FILE1      DD DSN=DCIAKK2.AKASH.VSAM1,DISP=SHR
//FILE2      DD DSN=DCIAKK2.AKASH.VSAM2,DISP=SHR
//SYSIN      DD *
  REPRO INFILE(FILE1) OUTFILE(FILE2)
/*
