JCL code to copy all members of a PDS to other PDS
//STEP01     EXEC PGM=IEBCOPY
//SYSPRINT   DD SYSOUT=*
//SYSUT1     DD DSN=DCIAKK2.AKASH.PDS1,DISP=SHR
//SYSUT2     DD DSN=DCIAKK2.AKASH.PDS2,DISP=SHR
