JCL code to copy records from PS to VSAM file
//STEP01     EXEC PGM=IEBGENER
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SYSUT1     DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SYSUT2     DD DSN=DCIAKK2.AKASH.VSAM,DISP=SHR
