JCL code to delete datasets in one go
/*JOBPARM  S=DDDD
//STEP01     EXEC PGM=IDCAMS
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *
  DELETE AAAH.AH4*.* FORCE
/*



/*JOBPARM  S=DDDD
//STEP01     EXEC PGM=IDCAMS
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *
  DELETE AAAH.AH8*.** MASK
/*
