JCL code to check file is empty or not by two methods
IN METHOD 1, IF IFLE IS EMPTY THEN RC=04 AND IF FILE IS NOT EMPTY RC=00 YOU WILL GET
IN METHOD 2,TESTING PENDING
Method 1:
//STEP01    EXEC PGM=IDCAMS
//FILE1     DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  PRINT INFILE(FILE1) CHARACTER COUNT(1)
/*

Method 2:
//STEP01    EXEC PGM=FILEAID
//INFILE    DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//OUTFILE   DD DSN=DCIAKK2.AKASH.EMPTY.FILE,DISP=SHR
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DUMMY
/*

