JCL code to check file is empty or not by two methods

Method 1:
//STEP01    EXEC PGM=IDCAMS
//FILE1     DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  PRINT INFILE(FILE1) CHARACTER COUNT(1)
/*

**If file is empty then we get RC=04 and if not empty then RC=0 

Method 2:
//STEP01    EXEC PGM=FILEAID
//INFILE    DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//OUTFILE   DD DSN=DCIAKK2.AKASH.EMPTY.FILE,DISP=SHR
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DUMMY
/*
