//JOBCARD
//STEP01     EXEC PGM=SORT
//SORTIN     DD DSN=VINXAK3.AKASH.PSFILE3,DISP=SHR
//SORTOUT    DD DSN=VINXAK3.AKASH.PSFILE3.ASCII,
//              DISP=(NEW,CATLG,DELETE),DCB=*.SORTIN
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *
  SORT FIELDS=COPY
  OUTREC BUILD=(1,80,TRAN=ETOA,X'0A')
/*
