JCL code to insert header in a file
//STEP1     EXEC PGM=SORT
//SORTIN    DD  DSN=INPUT.FILE,DISP=SHR
//SORTOUT   DD  DSN=OUTPUT.FILE,DISP=(NEW,CATLG,DELETE),
//              SPACE=(CYL,(10,5),RLSE)
//SYSOUT    DD  SYSOUT=*
//SYSIN     DD  *
  INREC BUILD=(C'AKASH GROUP OF COMPANY              DATE : DD/MM/YYYY',X'0A',1,80)
  SORT FIELDS=COPY
  OUTFIL FNAMES=SORTOUT
/*
