JCL code to extract matched records from two file
//STEP01     EXEC PGM=SORT
//SYSOUT     DD SYSOUT=*
//SORTJNF1   DD DSN=DCIAKK2.AKASH.FILE1,DISP=SHR
//SORTJNF2   DD DSN=DCIAKK2.AKASH.FILE2,DISP=SHR
//SORTOUT    DD DSN=DCIAKK2.MATCHED.RECORDS,DISP=SHR
//SYSIN      DD *
  SORT FIELDS=COPY
  JOINKEYS FILES=F1,FIELDS=(1,6,CH,A)
  JOINKEYS FILES=F2,FIELDS=(1,6,CH,A)
  REFORMAT FIELDS=(F1:1,50,F2:55,10)
/*
