JCL code to print the total number of records at bottom of file
//STEP01     EXEC PGM=IDCAMS
//SYSOUT     DD SYSOUT=*
//SYSPRINT   DD SYSOUT=*
//SORTIN     DD DSN=DCIAKK2.AKASH.RECORD,DISP=SHR
//SORTOUT    DD DSN=DCIAKK2.AKASH.RECORD.COUNT,DISP=SHR
//SYSIN      DD *
  SORT FIELDS=COPY
  OUTFIL REMOVECC,
  TRAILER1=('NUMBER OF RECORDS ARE ', COUNT=(M2,LENGTH=4))
/*
