//STEP01     EXEC PGM=ICETOOL
//DFSMSG     DD SYSOUT=*
//FILE1      DD DSN=PJ96106.AKASH.RECORD.COUNT,DISP=SHR
//TOOLMSG    DD SYSOUT=*
//TOOLIN     DD *
  COUNT FROM(FILE1)
/*
