JCL code to split the records of one file to many files
//STEP01     EXEC PGM=SORT
//SYSOUT     DD SYSOUT=*
//SORTIN     DD DSN=DCIAKK2.AKASH.FILE,DISP=SHR
//FILE1      DD DSN=DCIAKK2.AKASH.FILE.SPLIT1,DISP=SHR
//FILE2      DD DSN=DCIAKK2.AKASH.FILE.SPLIT2,DISP=SHR
//FILE3      DD DSN=DCIAKK2.AKASH.FILE.SPLIT3,DISP=SHR
//SYSIN      DD *
  SORT FIELDS=(1,6,CH,A)
  OUTFIL FNAMES(FILE1,FILE2,FILE3),SPLIT
/*
