JCL code to separate the unique and duplicate records from a file
//STEP01       EXEC PGM=SORT
//SYSOUT       DD SYSOUT=*
//SORTIN       DD DSN=DCIAKK2.AKASH.PSFILE,DISP=SHR
//SORTOUT      DD DSN=DCIAKK2.UNIQUE.RECORDS,DISP=SHR
//SORTXSUM     DD DSN=DCIAKK2.DUPLICATE.RECORDS,DISP=SHR
//SYSIN        DD *
  SORT FIELDS=(1,6,CH,A)
  SUM FIELDS=NONE,XSUM                     **TO GET ONLY UNIQUE RECORDS, REMOVE XSUM FROM SUM FIELDS AND REMOVE SORTXSUM DD FILE NAME**
/*
