JCL code to create VSAM file
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  DEFINE CLUSTER   - 
  (NAME(DCIAKK2.AKASH.VSAM.FILE)  -
   KEYS(5,0)  -
   TRK(50,50)  -
   RECORDSIZE(120 120)  -
   FREESPACE(10 20)  -
   NOREUSE  -
   INDEXED)  -
   DATA  -
   (NAME(DCIAKK2.AKASH.VSAM.FILE.DATA)  -
   CISZ(4096))  -
   INDEX  - 
   NAME(DCIAKK2.AKASH.VSAM.FILE.INDEX)
/*
